import sys
import math

"""
Практичне завдання №2.1
2.0/2.0 бали (оцінено)
Вхідні дані: 3 дійсних числа -- аргументи командного рядка.

Вихідні дані: результат обчислення формули


Аргументи передаються в порядку, зазначеному у формулі, назви змінних можуть використовуватися будь-які.

Приклад
Вхідні дані: 1 1 0.25
Приклад виклику: python lab2_1.py 1 1 0.25
Результат: 1.59576912161
"""

x = float(sys.argv[1])
y = float(sys.argv[2])
z = float(sys.argv[3])

result = (1/(z*math.sqrt(2*math.pi))*math.exp(-(x-y)**2/(2*(z**2))))
print(result)


"""Практичне завдання №2.2
2.0/2.0 бали (оцінено)
Вхідні дані: 3 числа x, y та z. x, y -- невід'ємні цілі числа, z дорівнює 0 або 1. x не дорівнює 0. Передаються як аргументи командного рядка.

Вихідні дані: рядок "Everybody sing a song: <текст пісеньки>.", де <текст пісеньки> формується з у куплетів, розділених пробілами. Всі куплети однакові і складаються з x 'la' через дефіс. Якщо z дорівнює одиниці, в кінці ставиться окличний знак, інакше крапка. За відсутності куплетів пробіл перед крапкою/окличним знаком не ставиться.

Підказка: для цього можна застосувати множення рядків.

Приклад
Вхідні дані: 2 3 1
Приклад виклику: python lab2_2.py 2 3 1
Результат: Everybody sing a song: la-la la-la la-la!
Вхідні дані: 1 0 0
Приклад виклику: python lab2_2.py 1 0 0
Результат: Everybody sing a song:."""


x = int(sys.argv[1])
y = int(sys.argv[2])
z = int(sys.argv[3])

la = "la"
kuplet = (x * (la + "-"))
kuplet = kuplet[:-1]
song = (y * (kuplet + " "))
song = song[:-1]

if z:
    final_result = "!"
else:
    final_result = "."
# print("Everybody sing a song:" + song + final_result)
